In [2]:
import pandas as pd
import numpy as np
df = pd.read_csv("adult_with_headers.csv")
df

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [3]:
df.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education_num   32561 non-null  int64
 5   marital_status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital_gain    32561 non-null  int64
 11  capital_loss    32561 non-null  int64
 12  hours_per_week  32561 non-null  int64
 13  native_country  32561 non-null  object
 14  income          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [5]:
df.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education_num     0
marital_status    0
occupation        0
relationship      0
race              0
sex               0
capital_gain      0
capital_loss      0
hours_per_week    0
native_country    0
income            0
dtype: int64

In [12]:
df_cont = df.iloc[:,10:12]
df_cont.head()

   capital_gain  capital_loss
0          2174             0
1             0             0
2             0             0
3             0             0
4             0             0

In [14]:
#Standardization
from sklearn.preprocessing import StandardScaler
SS = StandardScaler()
SS_x = SS.fit_transform(df_cont)
SS_X = pd.DataFrame(SS_x)
SS_X.columns = list(df_cont)
SS_X.head()

   capital_gain  capital_loss
0      0.148453      -0.21666
1     -0.145920      -0.21666
2     -0.145920      -0.21666
3     -0.145920      -0.21666
4     -0.145920      -0.21666

In [15]:
from sklearn.preprocessing import StandardScaler
SS = StandardScaler()
SS.fit_transform(df_cont)

array([[ 0.1484529 , -0.21665953],
       [-0.14592048, -0.21665953],
       [-0.14592048, -0.21665953],
       ...,
       [-0.14592048, -0.21665953],
       [-0.14592048, -0.21665953],
       [ 1.88842434, -0.21665953]])

In [16]:
from sklearn.preprocessing import MinMaxScaler
MM = MinMaxScaler()
MM_x = MM.fit_transform(df_cont)
MM_x = pd.DataFrame(MM_x)
MM_x.columns = list(df_cont)
MM_x.head()

   capital_gain  capital_loss
0       0.02174           0.0
1       0.00000           0.0
2       0.00000           0.0
3       0.00000           0.0
4       0.00000           0.0

In [30]:
# Identify categorical columns
categorical_cols = df.select_dtypes(include='object').columns
df_encoded = df.copy()

for col in categorical_cols:
    if df[col].nunique() < 5:
      
        dummies = pd.get_dummies(df_encoded[col], prefix=col, drop_first=True)
        df_encoded = pd.concat([df_encoded, dummies], axis=1)
       
        df_encoded = df_encoded.drop(columns=[col])

print("DataFrame after One-Hot Encoding for selected categorical variables:")
print(df_encoded.head())

DataFrame after One-Hot Encoding for selected categorical variables:
   age          workclass  fnlwgt   education  education_num  \
0   39          State-gov   77516   Bachelors             13
1   50   Self-emp-not-inc   83311   Bachelors             13
2   38            Private  215646     HS-grad              9
3   53            Private  234721        11th              7
4   28            Private  338409   Bachelors             13

        marital_status          occupation    relationship    race  \
0        Never-married        Adm-clerical   Not-in-family   White
1   Married-civ-spouse     Exec-managerial         Husband   White
2             Divorced   Handlers-cleaners   Not-in-family   White
3   Married-civ-spouse   Handlers-cleaners         Husband   Black
4   Married-civ-spouse      Prof-specialty            Wife   Black

   capital_gain  capital_loss  hours_per_week  native_country  sex_ Male  \
0          2174             0              40   United-States       True
1             0             0              13   United-States       True
2             0             0              40   United-States       True
3             0             0              40   United-States       True
4             0             0              40            Cuba      False

   income_ >50K
0         False
1         False
2         False
3         False
4         False

In [41]:
from sklearn.preprocessing import LabelEncoder
remaining_categorical_cols = df_encoded.select_dtypes(include='object').columns

df_labeled = df_encoded.copy()

for col in remaining_categorical_cols:
    le = LabelEncoder()
    df_labeled[col] = le.fit_transform(df_labeled[col])
    

print("\nDataFrame after Label Encoding (first 5 rows):")
print(df_labeled.head())

DataFrame after Label Encoding (first 5 rows):
   age  workclass  fnlwgt  education  education_num  marital_status  \
0   39          7   77516          9             13               4
1   50          6   83311          9             13               2
2   38          4  215646         11              9               0
3   53          4  234721          1              7               2
4   28          4  338409          9             13               2

   occupation  relationship  race  capital_gain  capital_loss  hours_per_week  \
0           1             1     4          2174             0              40
1           4             0     4             0             0              13
2           6             1     4             0             0              40
3           6             0     2             0             0              40
4          10             5     2             0             0              40

   native_country  sex_ Male  income_ >50K
0              39       True         False
1              39       True         False
2              39       True         False
3              39       True         False
4               5      False         False

In [42]:
# Create a copy to add new features to the labeled DataFrame
df_features = df_labeled.copy()

# Feature 1: Net_Capital_Movement
df_features['Net_Capital'] = df_features['capital_gain'] 
print("Added 'Net_Capital' feature.")

# Feature 2: High_Education_Hours_Interaction
df_features['High_Education'] = df_features['education_num'] 
print("Added 'High_Education' feature.")

print("\nDataFrame after adding new features:")
print(df_features.head())

Added 'Net_Capital' feature.
Added 'High_Education' feature.

DataFrame after adding new features:
   age  workclass  fnlwgt  education  education_num  marital_status  \
0   39          7   77516          9             13               4
1   50          6   83311          9             13               2
2   38          4  215646         11              9               0
3   53          4  234721          1              7               2
4   28          4  338409          9             13               2

   occupation  relationship  race  capital_gain  capital_loss  hours_per_week  \
0           1             1     4          2174             0              40
1           4             0     4             0             0              13
2           6             1     4             0             0              40
3           6             0     2             0             0              40
4          10             5     2             0             0              40

   native_country  sex_ Male  income_ >50K  Net_Capital  High_Education
0              39       True         False         2174              13
1              39       True         False            0              13
2              39       True         False            0               9
3              39       True         False            0               7
4               5      False         False            0              13

In [43]:
import numpy as np

initial_skewness = df_features['capital_gain'].skew()
print(f"Initial skewness of 'capital_gain': {initial_skewness:.2f}")

# Apply log1p transformation
df_features['capital_gain_log'] = np.log1p(df_features['capital_gain'])

# Check skewness after transformation
transformed_skewness = df_features['capital_gain_log'].skew()
print(f"Skewness of 'capital_gain_log' after transformation: {transformed_skewness:.2f}")

print("\nDataFrame after adding 'capital_gain_log' (first 5 rows):")
print(df_features[['capital_gain', 'capital_gain_log']].head())

SyntaxError: unterminated string literal (detected at line 13) (3782059863.py, line 13)